
********************************************** CELL SETUP ************************************************

# INITIALIZE BLAZEGRAPH INSTANCE WITH CITATIONS

blaze destroy --dataset kb --quiet
blaze create --dataset kb --quiet
blaze import --file ../data/citations.ttl --format ttl

------------------------------------------- SETUP OUTPUTS ------------------------------------------------



********************************************** CELL S1 ************************************************

# EXPORT CITATIONS AS N-TRIPLES

blaze export --format nt | sort

------------------------------------------- S1 OUTPUTS ------------------------------------------------

<http://learningsparql.com/ns/papers#paperA> <http://learningsparql.com/ns/citations#reports> <http://learningsparql.com/ns/papers#resultA> .
<http://learningsparql.com/ns/papers#paperA> <http://purl.org/dc/elements/1.1/title> "Paper A" .
<http://learningsparql.com/ns/papers#paperA> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://learningsparql.com/ns/citations#Paper> .
<http://learningsparql.com/ns/papers#paperB> <http://learningsparql.com/ns/citations#cites> <http://learningsparql.com/ns/papers#paperA> .
<http://learningsparql.com/ns/papers#paperB> <http://learningsparql.com/ns/citations#reports> <http://learningsparql.com/ns/papers#resultB> .
<http://learningsparql.com/ns/papers#paperB> <http://learningsparql.com/ns/citations#uses> <http://learningsparql.com/ns/papers#resultA> .
<http://learningsparql.com/ns/papers#paperB> <http://purl.org/dc/elements/1.1/title> "Paper B" .
<http://learningsparql.com/ns/papers#paperB> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://learningsparql.com/ns/citations#Paper> .
<http://learningsparql.com/ns/papers#paperC> <http://learningsparql.com/ns/citations#cites> <http://learningsparql.com/ns/papers#paperA> .
<http://learningsparql.com/ns/papers#paperC> <http://learningsparql.com/ns/citations#reports> <http://learningsparql.com/ns/papers#resultC> .
<http://learningsparql.com/ns/papers#paperC> <http://learningsparql.com/ns/citations#uses> <http://learningsparql.com/ns/papers#resultA> .
<http://learningsparql.com/ns/papers#paperC> <http://purl.org/dc/elements/1.1/title> "Paper C" .
<http://learningsparql.com/ns/papers#paperC> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://learningsparql.com/ns/citations#Paper> .
<http://learningsparql.com/ns/papers#paperD> <http://learningsparql.com/ns/citations#cites> <http://learningsparql.com/ns/papers#paperA> .
<http://learningsparql.com/ns/papers#paperD> <http://learningsparql.com/ns/citations#cites> <http://learningsparql.com/ns/papers#paperB> .
<http://learningsparql.com/ns/papers#paperD> <http://learningsparql.com/ns/citations#reports> <http://learningsparql.com/ns/papers#resultD1> .
<http://learningsparql.com/ns/papers#paperD> <http://learningsparql.com/ns/citations#reports> <http://learningsparql.com/ns/papers#resultD2> .
<http://learningsparql.com/ns/papers#paperD> <http://learningsparql.com/ns/citations#reports> <http://learningsparql.com/ns/papers#resultD3> .
<http://learningsparql.com/ns/papers#paperD> <http://learningsparql.com/ns/citations#uses> <http://learningsparql.com/ns/papers#resultB> .
<http://learningsparql.com/ns/papers#paperD> <http://purl.org/dc/elements/1.1/title> "Paper D" .
<http://learningsparql.com/ns/papers#paperD> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://learningsparql.com/ns/citations#Paper> .
<http://learningsparql.com/ns/papers#paperE> <http://learningsparql.com/ns/citations#cites> <http://learningsparql.com/ns/papers#paperA> .
<http://learningsparql.com/ns/papers#paperE> <http://learningsparql.com/ns/citations#reports> <http://learningsparql.com/ns/papers#resultE> .
<http://learningsparql.com/ns/papers#paperE> <http://learningsparql.com/ns/citations#uses> <http://learningsparql.com/ns/papers#resultA> .
<http://learningsparql.com/ns/papers#paperE> <http://purl.org/dc/elements/1.1/title> "Paper E" .
<http://learningsparql.com/ns/papers#paperE> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://learningsparql.com/ns/citations#Paper> .
<http://learningsparql.com/ns/papers#paperF> <http://learningsparql.com/ns/citations#cites> <http://learningsparql.com/ns/papers#paperC> .
<http://learningsparql.com/ns/papers#paperF> <http://learningsparql.com/ns/citations#cites> <http://learningsparql.com/ns/papers#paperE> .
<http://learningsparql.com/ns/papers#paperF> <http://learningsparql.com/ns/citations#reports> <http://learningsparql.com/ns/papers#resultF> .
<http://learningsparql.com/ns/papers#paperF> <http://learningsparql.com/ns/citations#uses> <http://learningsparql.com/ns/papers#resultC> .
<http://learningsparql.com/ns/papers#paperF> <http://purl.org/dc/elements/1.1/title> "Paper F" .
<http://learningsparql.com/ns/papers#paperF> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://learningsparql.com/ns/citations#Paper> .
<http://learningsparql.com/ns/papers#paperG> <http://learningsparql.com/ns/citations#cites> <http://learningsparql.com/ns/papers#paperC> .
<http://learningsparql.com/ns/papers#paperG> <http://learningsparql.com/ns/citations#cites> <http://learningsparql.com/ns/papers#paperE> .
<http://learningsparql.com/ns/papers#paperG> <http://learningsparql.com/ns/citations#reports> <http://learningsparql.com/ns/papers#resultG1> .
<http://learningsparql.com/ns/papers#paperG> <http://learningsparql.com/ns/citations#reports> <http://learningsparql.com/ns/papers#resultG2> .
<http://learningsparql.com/ns/papers#paperG> <http://learningsparql.com/ns/citations#uses> <http://learningsparql.com/ns/papers#resultE> .
<http://learningsparql.com/ns/papers#paperG> <http://purl.org/dc/elements/1.1/title> "Paper G" .
<http://learningsparql.com/ns/papers#paperG> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://learningsparql.com/ns/citations#Paper> .
<http://learningsparql.com/ns/papers#paperH> <http://learningsparql.com/ns/citations#cites> <http://learningsparql.com/ns/papers#paperD> .
<http://learningsparql.com/ns/papers#paperH> <http://learningsparql.com/ns/citations#reports> <http://learningsparql.com/ns/papers#resultH> .
<http://learningsparql.com/ns/papers#paperH> <http://learningsparql.com/ns/citations#uses> <http://learningsparql.com/ns/papers#resultD2> .
<http://learningsparql.com/ns/papers#paperH> <http://purl.org/dc/elements/1.1/title> "Paper H" .
<http://learningsparql.com/ns/papers#paperH> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://learningsparql.com/ns/citations#Paper> .
<http://learningsparql.com/ns/papers#paperI> <http://learningsparql.com/ns/citations#cites> <http://learningsparql.com/ns/papers#paperF> .
<http://learningsparql.com/ns/papers#paperI> <http://learningsparql.com/ns/citations#cites> <http://learningsparql.com/ns/papers#paperG> .
<http://learningsparql.com/ns/papers#paperI> <http://learningsparql.com/ns/citations#reports> <http://learningsparql.com/ns/papers#resultI> .
<http://learningsparql.com/ns/papers#paperI> <http://learningsparql.com/ns/citations#uses> <http://learningsparql.com/ns/papers#resultF> .
<http://learningsparql.com/ns/papers#paperI> <http://purl.org/dc/elements/1.1/title> "Paper I" .
<http://learningsparql.com/ns/papers#paperI> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://learningsparql.com/ns/citations#Paper> .
<http://learningsparql.com/ns/papers#resultA> <http://www.w3.org/2000/01/rdf-schema#label> "Result A" .
<http://learningsparql.com/ns/papers#resultB> <http://www.w3.org/2000/01/rdf-schema#label> "Result B" .
<http://learningsparql.com/ns/papers#resultC> <http://www.w3.org/2000/01/rdf-schema#label> "Result C" .
<http://learningsparql.com/ns/papers#resultD1> <http://www.w3.org/2000/01/rdf-schema#label> "Result D1" .
<http://learningsparql.com/ns/papers#resultD2> <http://www.w3.org/2000/01/rdf-schema#label> "Result D2" .
<http://learningsparql.com/ns/papers#resultD3> <http://www.w3.org/2000/01/rdf-schema#label> "Result D3" .
<http://learningsparql.com/ns/papers#resultE> <http://www.w3.org/2000/01/rdf-schema#label> "Result E" .
<http://learningsparql.com/ns/papers#resultF> <http://www.w3.org/2000/01/rdf-schema#label> "Result F" .
<http://learningsparql.com/ns/papers#resultG1> <http://www.w3.org/2000/01/rdf-schema#label> "Result G1" .
<http://learningsparql.com/ns/papers#resultG2> <http://www.w3.org/2000/01/rdf-schema#label> "Result G2" .
<http://learningsparql.com/ns/papers#resultH> <http://www.w3.org/2000/01/rdf-schema#label> "Result H" .
<http://learningsparql.com/ns/papers#resultI> <http://www.w3.org/2000/01/rdf-schema#label> "Result I" .


********************************************** CELL S2 ************************************************

# WHICH PAPERS DIRECTLY CITE WHICH PAPERS?

blaze query --format table << END_QUERY

    prefix c: <http://learningsparql.com/ns/citations#>

    SELECT DISTINCT ?citing_paper ?cited_paper
    WHERE {
        ?citing_paper c:cites ?cited_paper .
    }
    ORDER BY ?citing_paper ?cited_paper

END_QUERY

------------------------------------------- S2 OUTPUTS ------------------------------------------------

citing_paper                               | cited_paper
=======================================================================================
http://learningsparql.com/ns/papers#paperB | http://learningsparql.com/ns/papers#paperA
http://learningsparql.com/ns/papers#paperC | http://learningsparql.com/ns/papers#paperA
http://learningsparql.com/ns/papers#paperD | http://learningsparql.com/ns/papers#paperA
http://learningsparql.com/ns/papers#paperD | http://learningsparql.com/ns/papers#paperB
http://learningsparql.com/ns/papers#paperE | http://learningsparql.com/ns/papers#paperA
http://learningsparql.com/ns/papers#paperF | http://learningsparql.com/ns/papers#paperC
http://learningsparql.com/ns/papers#paperF | http://learningsparql.com/ns/papers#paperE
http://learningsparql.com/ns/papers#paperG | http://learningsparql.com/ns/papers#paperC
http://learningsparql.com/ns/papers#paperG | http://learningsparql.com/ns/papers#paperE
http://learningsparql.com/ns/papers#paperH | http://learningsparql.com/ns/papers#paperD
http://learningsparql.com/ns/papers#paperI | http://learningsparql.com/ns/papers#paperF
http://learningsparql.com/ns/papers#paperI | http://learningsparql.com/ns/papers#paperG


********************************************** CELL S3 ************************************************

# WHICH PAPERS DEPEND ON WHICH PRIOR WORK?

blaze query --format table << END_QUERY

    prefix c: <http://learningsparql.com/ns/citations#>

    SELECT DISTINCT ?paper ?prior_work
    WHERE {
        ?paper c:cites+ ?prior_work .
    }
    ORDER BY ?paper ?prior_work

END_QUERY

------------------------------------------- S3 OUTPUTS ------------------------------------------------

paper                                      | prior_work
=======================================================================================
http://learningsparql.com/ns/papers#paperB | http://learningsparql.com/ns/papers#paperA
http://learningsparql.com/ns/papers#paperC | http://learningsparql.com/ns/papers#paperA
http://learningsparql.com/ns/papers#paperD | http://learningsparql.com/ns/papers#paperA
http://learningsparql.com/ns/papers#paperD | http://learningsparql.com/ns/papers#paperB
http://learningsparql.com/ns/papers#paperE | http://learningsparql.com/ns/papers#paperA
http://learningsparql.com/ns/papers#paperF | http://learningsparql.com/ns/papers#paperA
http://learningsparql.com/ns/papers#paperF | http://learningsparql.com/ns/papers#paperC
http://learningsparql.com/ns/papers#paperF | http://learningsparql.com/ns/papers#paperE
http://learningsparql.com/ns/papers#paperG | http://learningsparql.com/ns/papers#paperA
http://learningsparql.com/ns/papers#paperG | http://learningsparql.com/ns/papers#paperC
http://learningsparql.com/ns/papers#paperG | http://learningsparql.com/ns/papers#paperE
http://learningsparql.com/ns/papers#paperH | http://learningsparql.com/ns/papers#paperA
http://learningsparql.com/ns/papers#paperH | http://learningsparql.com/ns/papers#paperB
http://learningsparql.com/ns/papers#paperH | http://learningsparql.com/ns/papers#paperD
http://learningsparql.com/ns/papers#paperI | http://learningsparql.com/ns/papers#paperA
http://learningsparql.com/ns/papers#paperI | http://learningsparql.com/ns/papers#paperC
http://learningsparql.com/ns/papers#paperI | http://learningsparql.com/ns/papers#paperE
http://learningsparql.com/ns/papers#paperI | http://learningsparql.com/ns/papers#paperF
http://learningsparql.com/ns/papers#paperI | http://learningsparql.com/ns/papers#paperG


********************************************** CELL S4 ************************************************

# WHICH PAPERS DEPEND ON PAPER A?

blaze query --format table << END_QUERY

    prefix c: <http://learningsparql.com/ns/citations#>
    prefix : <http://learningsparql.com/ns/papers#>

    SELECT DISTINCT ?paper
    WHERE {
        ?paper c:cites+ :paperA .
    }
    ORDER BY ?paper

END_QUERY

------------------------------------------- S4 OUTPUTS ------------------------------------------------

paper
=========================================
http://learningsparql.com/ns/papers#paperB
http://learningsparql.com/ns/papers#paperC
http://learningsparql.com/ns/papers#paperD
http://learningsparql.com/ns/papers#paperE
http://learningsparql.com/ns/papers#paperF
http://learningsparql.com/ns/papers#paperG
http://learningsparql.com/ns/papers#paperH
http://learningsparql.com/ns/papers#paperI


********************************************** CELL S5 ************************************************

# WHICH PAPERS CITE A PAPER THAT CITES PAPER A?

blaze query --format table << END_QUERY

    prefix c: <http://learningsparql.com/ns/citations#>
    prefix : <http://learningsparql.com/ns/papers#>

    SELECT DISTINCT ?paper
    WHERE {
        ?paper c:cites/c:cites :paperA .
    }
    ORDER BY ?paper

END_QUERY

------------------------------------------- S5 OUTPUTS ------------------------------------------------

paper
=========================================
http://learningsparql.com/ns/papers#paperD
http://learningsparql.com/ns/papers#paperF
http://learningsparql.com/ns/papers#paperG
http://learningsparql.com/ns/papers#paperH


********************************************** CELL S6 ************************************************

# WHICH PAPERS CITE A PAPER CITED BY PAPER D?

blaze query --format table << END_QUERY

    prefix c: <http://learningsparql.com/ns/citations#>
    prefix : <http://learningsparql.com/ns/papers#>

    SELECT DISTINCT ?paper
    WHERE {
        ?paper c:cites/^c:cites :paperD .
        FILTER(?paper != :paperD)
    }
    ORDER BY ?paper

END_QUERY

------------------------------------------- S6 OUTPUTS ------------------------------------------------

paper
=========================================
http://learningsparql.com/ns/papers#paperB
http://learningsparql.com/ns/papers#paperC
http://learningsparql.com/ns/papers#paperE


********************************************** CELL S7 ************************************************

# WHAT RESULTS DEPEND DIRECTLY ON RESULTS REPORTED BY PAPER A?

blaze query --format table << END_QUERY

    prefix c: <http://learningsparql.com/ns/citations#>
    prefix : <http://learningsparql.com/ns/papers#>

    SELECT DISTINCT ?result
    WHERE {
        :paperA c:reports/^c:uses/c:reports ?result
    }
    ORDER BY ?result

END_QUERY

------------------------------------------- S7 OUTPUTS ------------------------------------------------

result
==========================================
http://learningsparql.com/ns/papers#resultB
http://learningsparql.com/ns/papers#resultC
http://learningsparql.com/ns/papers#resultE


********************************************** CELL S7 ************************************************

# WHAT RESULTS DEPEND DIRECTLY OR INDIRECTLY ON RESULTS REPORTED BY PAPER A?

blaze query --format table << END_QUERY

    prefix c: <http://learningsparql.com/ns/citations#>
    prefix : <http://learningsparql.com/ns/papers#>

    SELECT DISTINCT ?result
    WHERE {
        :paperA c:reports/(^c:uses/c:reports)+ ?result
    }
    ORDER BY ?result

END_QUERY

------------------------------------------- S7 OUTPUTS ------------------------------------------------

result
===========================================
http://learningsparql.com/ns/papers#resultB
http://learningsparql.com/ns/papers#resultC
http://learningsparql.com/ns/papers#resultD1
http://learningsparql.com/ns/papers#resultD2
http://learningsparql.com/ns/papers#resultD3
http://learningsparql.com/ns/papers#resultE
http://learningsparql.com/ns/papers#resultF
http://learningsparql.com/ns/papers#resultG1
http://learningsparql.com/ns/papers#resultG2
http://learningsparql.com/ns/papers#resultH
http://learningsparql.com/ns/papers#resultI

